#-------------------------------------------------------------------------------
# 
#-------------------------------------------------------------------------------
from const import CONST

# Константы

# Токен для com-объекта Search
CONST.SEARCH_APP_TOKEN = 'S4.TS4App'

# Диапозоны значений в которых так же осуществлять поиск по спецификации,
# например 5 - для всех 5ЭТ.###
CONST.RANGES_WITH_SB_DRAWS = [0, 1, 5, 6]

# Инфикс компании
CONST.COMPANY_ID_INFIX = 'ЭТ'

# Запуск модуля по умолчанию
def main():
  return CONST

if __name__ == '__main__':
  main()
